#例-数据清洗

import pandas as pd

df = pd.read_excel('航天进出口额.xlsx')           # 导入Excel文件，得到一个二维数据表

# 1. 找到空值
# （1）找到包含空值的行
rows_with_null = df[df.isnull().any(axis=1)]    # axis=1表示按行查找
# 对于df.isnull().any(axis=1)的返回值，凡是为True的，则显示df中该行所有数据
print("包含空值的行：")
print(rows_with_null)

# （2）找到包含空值的列，返回列名
columns_with_null = df.columns[df.isnull().any()]  # 默认axis=0，表示按列查找 
# 对于df.isnull().any(axis=1)的返回值，凡是为True的，则显示df中该列的列名【只有'2023-12'没有空值，则不显示】
print("\n包含空值的列：")                     # 返回列名（Index类）
print(columns_with_null)

# （3）获取包含空值的行列名，并保存在一个列表中
null_indices = df.isnull().stack()               
print("\n包含空值的行列名：")
print(null_indices)
print()

# （4）遍历每一个包含空值的行列索引，返回包含空值的行列名列表
null_indices_list = []
for row, col in null_indices[null_indices].index:
    # 获取每行的“指标”及“进出口”列的值，然后与列名组合成一个子列表，添加到列表中
    ind_value = df.iloc[row]['指标']
    inex_value = df.iloc[row]['进出口']
    null_indices_list.append([ind_value, inex_value, col])
print("\n包含空值的行列名列表：")            #打印每个子列表
for it in null_indices_list:
    print(it)
    
# 2. 删除包含空值的行
df1 = df.dropna()             #删除包含空值的行，返回一个新的DateFrame
print("\n删除包含空值的行后，df1：",df1)
df1.to_excel('删除空值后.xlsx')

# 3.用空值的前一个值【本列中某空值上一行的值】填充"2022-01"列的空值
#df["2022-01"]=df["2022-01"].fillna(method="ffill")             #修改第b’列的值，填充空值。df['b']表示'b'列，同df.b
df["2022-01"]=df["2022-01"].ffill() 
print("\n用空值的前一个值填充2022-01列后，df：\n",df)
df.to_excel("用空值的前一个值填充2022-01列后.xlsx")

# 4. 用2022-01列的值填充2022-02列的空值 
df3 = df.fillna(value={"2022-02":df["2022-01"]})    #默认axis=0，按列填充
df3.to_excel('2022-01填充.xlsx')

# 4. 用每列的平均值填充每列空值
# （1）定义一个函数来对每列的空值填充该列的平均值
'''
首先使用 to_numeric()方法将列中的非数字值转换为数字，
如果出现无法转换的情况，设置 errors='coerce' 会将其转换为 NaN。
 然后再计算列的平均值并填充该列空值。这样就可以避免 TypeError 错误。
'''
def fill_na_with_column_mean(column):
    # 将列中的非数字值转换为数字
    numeric_column = pd.to_numeric(column, errors='coerce')
    # 计算列的平均值
    column_mean = numeric_column.mean()
    # 用平均值填充空值
    return column.fillna(column_mean)

# （2）对每列应用填充空值的函数
df4 = df.apply(fill_na_with_column_mean, axis=0)
df4.to_excel('平均值填充.xlsx')

# 5. 用0填充所有空值
df5 = df.fillna(0)
df5.to_excel("0填充.xlsx")

'''
所有包含空值的行：
                                     指标 进出口  地区  ... 2023-10 2023-11  2023-12
1   进口额(人民币)_(HS88章)航空器、航天器及其零件_中国香港_当期  进口  全国  ...    6.13   15.03     4.99
10   进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期  进口  全国  ...    0.97     NaN     0.04
14    进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期  进口  全国  ...    8.27   14.82     0.40
22    进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期  进口  全国  ...     NaN     NaN     3.94
24    进口额(人民币)_(HS88章)航空器、航天器及其零件_瑞典_当期  进口  全国  ...   67.04   25.36    11.59
27   进口额(人民币)_(HS88章)航空器、航天器及其零件_乌克兰_当期  进口  全国  ...  553.03     NaN    13.27
29    进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期  进口  全国  ...     NaN     NaN     0.12
32  进口额(人民币)_(HS88章)航空器、航天器及其零件_澳大利亚_当期  进口  全国  ...   20.78   19.33     0.27
33   进口额(人民币)_(HS88章)航空器、航天器及其零件_新西兰_当期  进口  全国  ...  133.17     NaN    97.54
41    出口额(人民币)_(HS88章)航空器、航天器及其零件_阿曼_当期  出口  全国  ...    0.67   11.00    24.60
42  出口额(人民币)_(HS88章)航空器、航天器及其零件_巴基斯坦_当期  出口  全国  ...  264.08   61.53   389.66
63    出口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期  出口  全国  ...    4.61     NaN     1.36
65    出口额(人民币)_(HS88章)航空器、航天器及其零件_瑞典_当期  出口  全国  ...   17.99   19.43    18.97

[13 rows x 29 columns]

所有包含空值的列名：
Index(['2022-01', '2022-02', '2022-03', '2022-04', '2022-05', '2022-06',
       '2022-07', '2022-08', '2022-09', '2022-10', '2022-11', '2022-12',
       '2023-01', '2023-02', '2023-03', '2023-04', '2023-05', '2023-06',
       '2023-07', '2023-08', '2023-09', '2023-10', '2023-11'],
      dtype='object')

包含空值的行列名列表：
['进口额(人民币)_(HS88章)航空器、航天器及其零件_中国香港_当期', '进口', '2022-03']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_中国香港_当期', '进口', '2022-04']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_中国香港_当期', '进口', '2022-08']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_中国香港_当期', '进口', '2022-09']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_中国香港_当期', '进口', '2023-07']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2022-01']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2022-02']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2022-04']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2022-06']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2022-08']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2022-09']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2022-10']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2022-11']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2022-12']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2023-02']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2023-03']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2023-05']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2023-07']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期', '进口', '2023-11']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期', '进口', '2022-02']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期', '进口', '2022-04']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期', '进口', '2022-06']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期', '进口', '2022-07']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期', '进口', '2022-08']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期', '进口', '2022-10']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期', '进口', '2022-11']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期', '进口', '2022-12']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期', '进口', '2023-01']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期', '进口', '2023-03']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期', '进口', '2023-06']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2022-01']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2022-02']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2022-03']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2022-05']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2022-07']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2022-08']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2022-09']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2022-10']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2022-12']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2023-01']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2023-02']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2023-03']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2023-04']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2023-05']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2023-07']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2023-08']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2023-09']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2023-10']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '进口', '2023-11']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_瑞典_当期', '进口', '2022-05']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_瑞典_当期', '进口', '2022-08']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_瑞典_当期', '进口', '2023-01']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_乌克兰_当期', '进口', '2022-03']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_乌克兰_当期', '进口', '2022-05']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_乌克兰_当期', '进口', '2022-08']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_乌克兰_当期', '进口', '2022-09']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_乌克兰_当期', '进口', '2022-11']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_乌克兰_当期', '进口', '2023-01']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_乌克兰_当期', '进口', '2023-03']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_乌克兰_当期', '进口', '2023-09']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_乌克兰_当期', '进口', '2023-11']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-01']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-02']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-03']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-04']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-05']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-06']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-07']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-08']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-09']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-10']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-11']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2022-12']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2023-01']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2023-02']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2023-03']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2023-04']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2023-05']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2023-06']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2023-07']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2023-08']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2023-09']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2023-10']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期', '进口', '2023-11']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_澳大利亚_当期', '进口', '2022-02']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_澳大利亚_当期', '进口', '2023-02']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_新西兰_当期', '进口', '2022-01']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_新西兰_当期', '进口', '2022-02']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_新西兰_当期', '进口', '2022-04']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_新西兰_当期', '进口', '2022-10']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_新西兰_当期', '进口', '2022-12']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_新西兰_当期', '进口', '2023-01']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_新西兰_当期', '进口', '2023-06']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_新西兰_当期', '进口', '2023-07']
['进口额(人民币)_(HS88章)航空器、航天器及其零件_新西兰_当期', '进口', '2023-11']
['出口额(人民币)_(HS88章)航空器、航天器及其零件_阿曼_当期', '出口', '2022-04']
['出口额(人民币)_(HS88章)航空器、航天器及其零件_阿曼_当期', '出口', '2022-11']
['出口额(人民币)_(HS88章)航空器、航天器及其零件_巴基斯坦_当期', '出口', '2022-01']
['出口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '出口', '2023-02']
['出口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '出口', '2023-04']
['出口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '出口', '2023-09']
['出口额(人民币)_(HS88章)航空器、航天器及其零件_芬兰_当期', '出口', '2023-11']
['出口额(人民币)_(HS88章)航空器、航天器及其零件_瑞典_当期', '出口', '2022-02']
['出口额(人民币)_(HS88章)航空器、航天器及其零件_瑞典_当期', '出口', '2023-01']

删除包含空值的行后df2：                                       指标 进出口    ...        2023-11    2023-12
0      进口额(人民币)_(HS88章)航空器、航天器及其零件_印度_当期  进口    ...         827.64     795.53
2      进口额(人民币)_(HS88章)航空器、航天器及其零件_日本_当期  进口    ...        1367.80    3274.18
3    进口额(人民币)_(HS88章)航空器、航天器及其零件_马来西亚_当期  进口    ...         966.05    1326.76
4    进口额(人民币)_(HS88章)航空器、航天器及其零件_中国台湾_当期  进口    ...         635.39     915.41
5     进口额(人民币)_(HS88章)航空器、航天器及其零件_菲律宾_当期  进口    ...        1459.06     631.61
6     进口额(人民币)_(HS88章)航空器、航天器及其零件_新加坡_当期  进口    ...        1555.67    1450.25
7      进口额(人民币)_(HS88章)航空器、航天器及其零件_韩国_当期  进口    ...        3912.85    4769.89
8      进口额(人民币)_(HS88章)航空器、航天器及其零件_泰国_当期  进口    ...          16.86      41.40
9     进口额(人民币)_(HS88章)航空器、航天器及其零件_土耳其_当期  进口    ...         267.02     245.89
11     进口额(人民币)_(HS88章)航空器、航天器及其零件_越南_当期  进口    ...          13.29       6.89
12     进口额(人民币)_(HS88章)航空器、航天器及其零件_南非_当期  进口    ...          50.33      32.25
13    进口额(人民币)_(HS88章)航空器、航天器及其零件_比利时_当期  进口    ...         933.94     768.22
15     进口额(人民币)_(HS88章)航空器、航天器及其零件_英国_当期  进口    ...       13903.46   12652.06
16     进口额(人民币)_(HS88章)航空器、航天器及其零件_德国_当期  进口    ...       29110.57  211054.92
17     进口额(人民币)_(HS88章)航空器、航天器及其零件_法国_当期  进口    ...      125120.87  185174.42
18    进口额(人民币)_(HS88章)航空器、航天器及其零件_意大利_当期  进口    ...       27282.24     644.66
19     进口额(人民币)_(HS88章)航空器、航天器及其零件_荷兰_当期  进口    ...           9.60      62.40
20    进口额(人民币)_(HS88章)航空器、航天器及其零件_西班牙_当期  进口    ...        5600.28    4869.75
21    进口额(人民币)_(HS88章)航空器、航天器及其零件_奥地利_当期  进口    ...        1235.65    1716.49
23   进口额(人民币)_(HS88章)航空器、航天器及其零件_罗马尼亚_当期  进口    ...          42.06      43.78
25     进口额(人民币)_(HS88章)航空器、航天器及其零件_瑞士_当期  进口    ...         105.24     192.30
26    进口额(人民币)_(HS88章)航空器、航天器及其零件_俄罗斯_当期  进口    ...       27687.90    6696.86
28     进口额(人民币)_(HS88章)航空器、航天器及其零件_巴西_当期  进口    ...          33.28      10.79
30    进口额(人民币)_(HS88章)航空器、航天器及其零件_加拿大_当期  进口    ...       74356.70   16092.11
31     进口额(人民币)_(HS88章)航空器、航天器及其零件_美国_当期  进口    ...      154529.38  221967.76
34     进口额(人民币)_(HS88章)航空器、航天器及其零件_欧盟_当期  进口    ...      191550.91  406055.97
35   出口额(人民币)_(HS88章)航空器、航天器及其零件_中国香港_当期  出口    ...       24097.76  196157.70
36     出口额(人民币)_(HS88章)航空器、航天器及其零件_印度_当期  出口    ...        2015.34    2185.93
37  出口额(人民币)_(HS88章)航空器、航天器及其零件_印度尼西亚_当期  出口    ...        2758.34    1487.52
38     出口额(人民币)_(HS88章)航空器、航天器及其零件_日本_当期  出口    ...        6499.33    2180.95
..                                   ...  ..    ...            ...        ...
44  出口额(人民币)_(HS88章)航空器、航天器及其零件_沙特阿拉伯_当期  出口    ...       43594.62    3442.22
45    出口额(人民币)_(HS88章)航空器、航天器及其零件_新加坡_当期  出口    ...       33826.53    1569.17
46     出口额(人民币)_(HS88章)航空器、航天器及其零件_韩国_当期  出口    ...        3200.10    2767.46
47     出口额(人民币)_(HS88章)航空器、航天器及其零件_泰国_当期  出口    ...        3464.53    1581.64
48    出口额(人民币)_(HS88章)航空器、航天器及其零件_土耳其_当期  出口    ...        1415.34     724.24
49    出口额(人民币)_(HS88章)航空器、航天器及其零件_阿联酋_当期  出口    ...        3223.78    7914.53
50     出口额(人民币)_(HS88章)航空器、航天器及其零件_越南_当期  出口    ...        3168.00    2941.89
51   出口额(人民币)_(HS88章)航空器、航天器及其零件_中国台湾_当期  出口    ...        1511.60    1128.59
52  出口额(人民币)_(HS88章)航空器、航天器及其零件_哈萨克斯坦_当期  出口    ...          94.21     133.53
53     出口额(人民币)_(HS88章)航空器、航天器及其零件_南非_当期  出口    ...        1200.10    1005.18
54    出口额(人民币)_(HS88章)航空器、航天器及其零件_比利时_当期  出口    ...        2093.78     633.83
55     出口额(人民币)_(HS88章)航空器、航天器及其零件_丹麦_当期  出口    ...        5485.22    4153.62
56     出口额(人民币)_(HS88章)航空器、航天器及其零件_英国_当期  出口    ...       13627.92   14692.57
57     出口额(人民币)_(HS88章)航空器、航天器及其零件_德国_当期  出口    ...       19220.43   16461.19
58     出口额(人民币)_(HS88章)航空器、航天器及其零件_法国_当期  出口    ...       28730.76   26963.63
59    出口额(人民币)_(HS88章)航空器、航天器及其零件_意大利_当期  出口    ...        3274.75    2351.46
60     出口额(人民币)_(HS88章)航空器、航天器及其零件_荷兰_当期  出口    ...        8995.30   16705.58
61    出口额(人民币)_(HS88章)航空器、航天器及其零件_西班牙_当期  出口    ...        4498.08    3985.59
62    出口额(人民币)_(HS88章)航空器、航天器及其零件_奥地利_当期  出口    ...         849.95    1284.73
64   出口额(人民币)_(HS88章)航空器、航天器及其零件_罗马尼亚_当期  出口    ...         205.06     118.75
66     出口额(人民币)_(HS88章)航空器、航天器及其零件_瑞士_当期  出口    ...        2481.44    1056.43
67    出口额(人民币)_(HS88章)航空器、航天器及其零件_俄罗斯_当期  出口    ...       17399.22   18058.77
68    出口额(人民币)_(HS88章)航空器、航天器及其零件_阿根廷_当期  出口    ...         192.32     786.51
69     出口额(人民币)_(HS88章)航空器、航天器及其零件_巴西_当期  出口    ...        3889.99    2171.89
70     出口额(人民币)_(HS88章)航空器、航天器及其零件_智利_当期  出口    ...         945.67     661.83
71    出口额(人民币)_(HS88章)航空器、航天器及其零件_加拿大_当期  出口    ...       17882.84   23367.44
72     出口额(人民币)_(HS88章)航空器、航天器及其零件_美国_当期  出口    ...       51454.82   43832.81
73   出口额(人民币)_(HS88章)航空器、航天器及其零件_澳大利亚_当期  出口    ...        9710.60    4595.24
74    出口额(人民币)_(HS88章)航空器、航天器及其零件_新西兰_当期  出口    ...         748.95    1715.07
75     出口额(人民币)_(HS88章)航空器、航天器及其零件_欧盟_当期  出口    ...       87407.60   88556.69

[63 rows x 29 columns]


'''

