#例-合并3个Excel表【采用concat方法】.py

import pandas as pd

#1、导入Excel文件
df1=pd.read_excel('数据表1.xlsx')        #读入Excel文件，返回一个二维数据表
df2=pd.read_excel('数据表2.xlsx')   
df3=pd.read_excel('数据表3.xlsx')   

print("df1:\n",df1)
print("df2:\n",df2)
print("df3:\n",df3)
print()

#2、合并三个数据集，并返回合并后数据集
#采用concat方法
#将一个数据表中的所有行（默认参数axis=0）添加到另一个数据表的末尾，返回一个新的数据表
df4=pd.concat([df1,df2],axis=0)
df=pd.concat([df4,df3],axis=0)
print("合并后的\"一带一路\"贸易指数：\n",df)

#3、修改行索引【因为合并后数据集的行索引有重复，均为0~9】
df_count=df['时间'].count()                 #二维数据表的行数
print("合并后的\"一带一路\"贸易指数表的行数：",df_count)
df.index = [i+1 for i in range(0,df_count)]  #修改行索引为1、2、3……

#4、导出数据
df.to_excel("合并后的一带一路贸易指数表.xlsx")         #写入Excel文件


'''

  import pandas as pd
df1:
         时间  "一带一路"贸易额指数_东南亚_当期  "一带一路"贸易额指数_中亚_当期  ...  "一带一路"贸易额指数_欧洲_当期  "一带一路"贸易额指数_蒙俄_当期  "一带一路"贸易额指数_西亚_当期
0  2022-03              148.26             184.35  ...             214.84             232.69             136.31
1  2022-04              186.95             191.96  ...             199.97             219.63             153.78
2  2022-05              196.61             194.11  ...             196.75             246.40             177.92
3  2022-06              202.20             187.63  ...             204.43             276.71             192.53
4  2022-07              223.77             249.79  ...             209.21             287.66             170.67
5  2022-08              214.95             230.62  ...             216.33             315.51             179.34

[6 rows x 9 columns]
df2:
         时间  "一带一路"贸易额指数_东南亚_当期  "一带一路"贸易额指数_中亚_当期  ...  "一带一路"贸易额指数_欧洲_当期  "一带一路"贸易额指数_蒙俄_当期  "一带一路"贸易额指数_西亚_当期
0  2022-09              207.38             243.80  ...             228.56             358.31             175.96
1  2022-10              230.66             246.85  ...             223.11             360.81             176.13
2  2022-11              203.13             206.33  ...             181.20             329.75             172.38
3  2022-12              223.18             230.77  ...             209.97             351.27             183.31
4  2023-01              222.68             243.88  ...             196.43             338.22             172.91
5  2023-02              178.47             198.78  ...             218.08             324.61             171.67

[6 rows x 9 columns]
df3:
         时间  "一带一路"贸易额指数_东南亚_当期  "一带一路"贸易额指数_中亚_当期  ...  "一带一路"贸易额指数_欧洲_当期  "一带一路"贸易额指数_蒙俄_当期  "一带一路"贸易额指数_西亚_当期
0  2023-03              180.37             227.55  ...             182.77             340.44             140.87
1  2023-04              221.61             236.86  ...             225.30             380.48             179.33
2  2023-05              196.48             272.10  ...             221.29             374.33             166.80
3  2023-06              179.35             292.27  ...             214.37             383.24             166.11
4  2023-07              197.78             258.15  ...             210.74             402.32             158.42
5  2023-08              177.37             285.71  ...             208.70             363.91             145.23

[6 rows x 9 columns]

合并后的"一带一路"贸易指数：
         时间  "一带一路"贸易额指数_东南亚_当期  "一带一路"贸易额指数_中亚_当期  ...  "一带一路"贸易额指数_欧洲_当期  "一带一路"贸易额指数_蒙俄_当期  "一带一路"贸易额指数_西亚_当期
0  2022-03              148.26             184.35  ...             214.84             232.69             136.31
1  2022-04              186.95             191.96  ...             199.97             219.63             153.78
2  2022-05              196.61             194.11  ...             196.75             246.40             177.92
3  2022-06              202.20             187.63  ...             204.43             276.71             192.53
4  2022-07              223.77             249.79  ...             209.21             287.66             170.67
5  2022-08              214.95             230.62  ...             216.33             315.51             179.34
0  2022-09              207.38             243.80  ...             228.56             358.31             175.96
1  2022-10              230.66             246.85  ...             223.11             360.81             176.13
2  2022-11              203.13             206.33  ...             181.20             329.75             172.38
3  2022-12              223.18             230.77  ...             209.97             351.27             183.31
4  2023-01              222.68             243.88  ...             196.43             338.22             172.91
5  2023-02              178.47             198.78  ...             218.08             324.61             171.67
0  2023-03              180.37             227.55  ...             182.77             340.44             140.87
1  2023-04              221.61             236.86  ...             225.30             380.48             179.33
2  2023-05              196.48             272.10  ...             221.29             374.33             166.80
3  2023-06              179.35             292.27  ...             214.37             383.24             166.11
4  2023-07              197.78             258.15  ...             210.74             402.32             158.42
5  2023-08              177.37             285.71  ...             208.70             363.91             145.23


'''


