#例-合并3个Excel表【采用merge方法】.py

import pandas as pd

#1、导入Excel文件
df1=pd.read_excel('数据表1.xlsx')        #读入Excel文件，返回一个二维数据表
df2=pd.read_excel('数据表2.xlsx')   
df3=pd.read_excel('数据表3.xlsx')   

print("df1:\n",df1)
print("df2:\n",df2)
print("df3:\n",df3)
print()

#2、合并三个数据集，并返回合并后数据集
df4=pd.merge(df1,df2,how='outer')           #采用merge方法合并df1和df2，并集
df=pd.merge(df4,df3,how='outer')            #合并df4和df3
print("合并后的\"一带一路\"贸易指数：\n",df)

#3、修改行索引【因为合并后数据集的行索引有重复，均为0~9】
df_count=df['时间'].count()                 #二维数据表的行数
print("合并后的\"一带一路\"贸易指数表的行数：",df_count)
df.index = [i+1 for i in range(0,df_count)]  #修改行索引为1、2、3……

#4、导出数据
df.to_excel("合并后的一带一路贸易指数表.xlsx")  #写入Excel文件

'''
        
  import pandas as pd
df1:
         时间  "一带一路"贸易额指数_东南亚_当期  ...  "一带一路"贸易额指数_蒙俄_当期  "一带一路"贸易额指数_西亚_当期
0  2022-03              148.26  ...             232.69             136.31
1  2022-04              186.95  ...             219.63             153.78
2  2022-05              196.61  ...             246.40             177.92
3  2022-06              202.20  ...             276.71             192.53
4  2022-07              223.77  ...             287.66             170.67
5  2022-08              214.95  ...             315.51             179.34

[6 rows x 9 columns]
df2:
         时间  "一带一路"贸易额指数_东南亚_当期  ...  "一带一路"贸易额指数_蒙俄_当期  "一带一路"贸易额指数_西亚_当期
0  2022-09              207.38  ...             358.31             175.96
1  2022-10              230.66  ...             360.81             176.13
2  2022-11              203.13  ...             329.75             172.38
3  2022-12              223.18  ...             351.27             183.31
4  2023-01              222.68  ...             338.22             172.91
5  2023-02              178.47  ...             324.61             171.67

[6 rows x 9 columns]
df3:
         时间  "一带一路"贸易额指数_东南亚_当期  ...  "一带一路"贸易额指数_蒙俄_当期  "一带一路"贸易额指数_西亚_当期
0  2023-03              180.37  ...             340.44             140.87
1  2023-04              221.61  ...             380.48             179.33
2  2023-05              196.48  ...             374.33             166.80
3  2023-06              179.35  ...             383.24             166.11
4  2023-07              197.78  ...             402.32             158.42
5  2023-08              177.37  ...             363.91             145.23

[6 rows x 9 columns]

合并后的"一带一路"贸易指数：
          时间  "一带一路"贸易额指数_东南亚_当期  ...  "一带一路"贸易额指数_蒙俄_当期  "一带一路"贸易额指数_西亚_当期
0   2022-03              148.26  ...             232.69             136.31
1   2022-04              186.95  ...             219.63             153.78
2   2022-05              196.61  ...             246.40             177.92
3   2022-06              202.20  ...             276.71             192.53
4   2022-07              223.77  ...             287.66             170.67
5   2022-08              214.95  ...             315.51             179.34
6   2022-09              207.38  ...             358.31             175.96
7   2022-10              230.66  ...             360.81             176.13
8   2022-11              203.13  ...             329.75             172.38
9   2022-12              223.18  ...             351.27             183.31
10  2023-01              222.68  ...             338.22             172.91
11  2023-02              178.47  ...             324.61             171.67
12  2023-03              180.37  ...             340.44             140.87
13  2023-04              221.61  ...             380.48             179.33
14  2023-05              196.48  ...             374.33             166.80
15  2023-06              179.35  ...             383.24             166.11
16  2023-07              197.78  ...             402.32             158.42
17  2023-08              177.37  ...             363.91             145.23

[18 rows x 9 columns]
合并后的"一带一路"贸易指数表的行数： 18

'''


