# -*- coding: utf-8 -*-
#例-加入数据.py
#如何给一个二维数据表增加行或列？

import pandas as pd
import numpy as np

#1、创建二维数据表
data1={'时间': ['2022-03', '2022-04', '2022-05', '2022-06'], 
       '东南亚': [148.26, 186.95, 196.61, 202.2]}
data2={'时间': ['2022-07', '2022-08', '2022-09', '2022-10'], 
       '东南亚': [223.77, 214.95, 207.38, 230.66]}
df1 = pd.DataFrame(data1,index=range(4))  
df2 = pd.DataFrame(data2,index=range(4,8))

print("df1:","\n",df1)
print("df2:","\n",df2)
print()

#2、采用concat()方法增加行
# append在pandas2.0中已经被弃用
# append_result=df1.append(df2)		  #append()方法将df2中的所有行添加到df1的末尾（列数应该相同）
append_result = pd.concat([df1, df2])
print("append_result:","\n",append_result)
print("\ndf1不变:","\n",df1)                    #原数据表不变
print()

#3、采用concat()方法增加列
data3={'时间': ['2022-03', '2022-04', '2022-05', '2022-06', '2022-07', '2022-08', '2022-09', '2022-10'],
       '中亚': [184.35, 191.96, 194.11, 187.63, 249.79, 230.62, 243.8, 246.85]}
df3 = pd.DataFrame(data3) 
print("df3:","\n",df3)
print()
#将df3中的所有列添加到append_result的末尾（行数应该相同）。axis=1表示沿1轴连接，即按列添加（默认参数axis=0，表示按行添加）。
concat_result=pd.concat([append_result, df3],axis=1) 
print("concat_result:","\n",concat_result)

concat_result.to_excel("东南亚及中亚贸易.xlsx")            #写入Excel文件


'''

  import pandas as pd
df1: 
         时间     东南亚
0  2022-03  148.26
1  2022-04  186.95
2  2022-05  196.61
3  2022-06  202.20
df2: 
         时间     东南亚
4  2022-07  223.77
5  2022-08  214.95
6  2022-09  207.38
7  2022-10  230.66

append_result: 
         时间     东南亚
0  2022-03  148.26
1  2022-04  186.95
2  2022-05  196.61
3  2022-06  202.20
4  2022-07  223.77
5  2022-08  214.95
6  2022-09  207.38
7  2022-10  230.66

df1不变: 
         时间     东南亚
0  2022-03  148.26
1  2022-04  186.95
2  2022-05  196.61
3  2022-06  202.20

df3: 
         时间      中亚
0  2022-03  184.35
1  2022-04  191.96
2  2022-05  194.11
3  2022-06  187.63
4  2022-07  249.79
5  2022-08  230.62
6  2022-09  243.80
7  2022-10  246.85

concat_result: 
         时间     东南亚       时间      中亚
0  2022-03  148.26  2022-03  184.35
1  2022-04  186.95  2022-04  191.96
2  2022-05  196.61  2022-05  194.11
3  2022-06  202.20  2022-06  187.63
4  2022-07  223.77  2022-07  249.79
5  2022-08  214.95  2022-08  230.62
6  2022-09  207.38  2022-09  243.80
7  2022-10  230.66  2022-10  246.85

'''