# 例-数据分类汇总示例：贸易额汇总

import pandas as pd
import numpy as np 

#1、导入Excel文件，得到一个二维数据表
df = pd.read_excel('航天进出口额_部分.xlsx')   #导入Excel文件【read_excel方法返回一个二维数据表】
print("df:\n",df)
print()

#2、按'地区'分类，对'地区'字段进行计数
df_count=df.groupby('地区')['地区'].count()      
print("对'地区'字段进行计数,df_count:\n",df_count)
print()

#3、按'地区'和'进出口'分类，并分别计算5-7列的均值
col = list(df.columns)                   #查看数据表的列名称，并转换为列表
#print(col[5:8])                         #列索引从0开始，col[5:8]返回5-7列的列名称
df_mean=df.groupby(['地区', '进出口'])[col[5:8]].mean() #先按地区分组，再按进出口分组；计算5-7列的均值
print("分别计算各个地区的均值,df_mean:\n",df_mean)
print()

#4、按'地区'和'进出口'分类，并分别计算该地区的数据条数、'2022-01'的总贸易额和均值
df_202201=df.groupby(['地区', '进出口'])['2022-01'].agg([len,np.sum, np.mean])
print("2022-01的贸易额和均值, df_202201: \n",df_202201)
print()

#5、按列小计（即按列求和）
df_sum=df.sum(skipna=True, numeric_only=True)
#skipna=True表示跳过空值，numeric_only=True表示只对数字操作，字符列不进行操作                        
print("按列求和，df_sum：\n",df_sum)             
print()

#6、按列求均值
df_mean=df.mean(skipna=True, numeric_only=True)                                
print("按列求均值，df_mean：\n",df_mean)

'''

df:
                                      指标  地区 进出口 频度  单位    2022-01    2022-02    2022-03            平均值
0     进口额(人民币)_(HS88章)航空器、航天器及其零件_印度_当期  亚洲  进口  月  万元     288.13     601.83     277.40     389.120000
1     进口额(人民币)_(HS88章)航空器、航天器及其零件_日本_当期  亚洲  进口  月  万元    2653.87    1473.53    1739.32    1955.573333
2   进口额(人民币)_(HS88章)航空器、航天器及其零件_马来西亚_当期  亚洲  进口  月  万元    1668.97     852.08    1181.90    1234.316667
3     进口额(人民币)_(HS88章)航空器、航天器及其零件_英国_当期  欧洲  进口  月  万元   17830.64    5229.31    9072.58   10710.843333
4     进口额(人民币)_(HS88章)航空器、航天器及其零件_德国_当期  欧洲  进口  月  万元  173784.18  177434.85  100714.11  150644.380000
5     进口额(人民币)_(HS88章)航空器、航天器及其零件_法国_当期  欧洲  进口  月  万元  110793.24  116927.32  118682.46  115467.673333
6    进口额(人民币)_(HS88章)航空器、航天器及其零件_意大利_当期  欧洲  进口  月  万元     882.02     137.26     199.43     406.236667
7     进口额(人民币)_(HS88章)航空器、航天器及其零件_巴西_当期  美洲  进口  月  万元       1.38       1.50      37.24      13.373333
8    进口额(人民币)_(HS88章)航空器、航天器及其零件_加拿大_当期  美洲  进口  月  万元    5766.20    8789.30    9596.23    8050.576667
9     进口额(人民币)_(HS88章)航空器、航天器及其零件_美国_当期  美洲  进口  月  万元  222108.98   61007.40  139219.94  140778.773333
10    出口额(人民币)_(HS88章)航空器、航天器及其零件_印度_当期  亚洲  出口  月  万元    1687.89     458.36    1211.85    1119.366667
11    出口额(人民币)_(HS88章)航空器、航天器及其零件_日本_当期  亚洲  出口  月  万元    9663.76    9925.75    6362.97    8650.826667
12  出口额(人民币)_(HS88章)航空器、航天器及其零件_马来西亚_当期  亚洲  出口  月  万元     833.23    2760.34     633.01    1408.860000
13    出口额(人民币)_(HS88章)航空器、航天器及其零件_英国_当期  欧洲  出口  月  万元   15860.74    5365.62    6235.02    9153.793333
14    出口额(人民币)_(HS88章)航空器、航天器及其零件_德国_当期  欧洲  出口  月  万元    7896.63    7779.91   20653.80   12110.113333
15    出口额(人民币)_(HS88章)航空器、航天器及其零件_法国_当期  欧洲  出口  月  万元   19730.18    9696.54    9584.94   13003.886667
16   出口额(人民币)_(HS88章)航空器、航天器及其零件_意大利_当期  欧洲  出口  月  万元    1052.07     567.35    1335.85     985.090000
17    出口额(人民币)_(HS88章)航空器、航天器及其零件_巴西_当期  美洲  出口  月  万元     242.21     904.72    2536.92    1227.950000
18   出口额(人民币)_(HS88章)航空器、航天器及其零件_加拿大_当期  美洲  出口  月  万元    3470.77    4763.81    4899.25    4377.943333
19    出口额(人民币)_(HS88章)航空器、航天器及其零件_美国_当期  美洲  出口  月  万元  196100.19   30478.94   96558.69  107712.606667

对'地区'字段进行计数,df_count:
 地区
亚洲    6
欧洲    8
美洲    6
Name: 地区, dtype: int64

分别计算各个地区的均值,df_mean:
              2022-01       2022-02       2022-03
地区 进出口                                          
亚洲 出口    4061.626667   4381.483333   2735.943333
   进口    1536.990000    975.813333   1066.206667
欧洲 出口   11134.905000   5852.355000   9452.402500
   进口   75822.520000  74932.185000  57167.145000
美洲 出口   66604.390000  12049.156667  34664.953333
   进口   75958.853333  23266.066667  49617.803333

/Users/tea/Desktop/pptCODE2/例13.9/例13.9-数据汇总示例：贸易额汇总.py:24: FutureWarning: The provided callable <function sum at 0x1010bd9e0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df_202201=df.groupby(['地区', '进出口'])['2022-01'].agg([len,np.sum, np.mean])
/Users/tea/Desktop/pptCODE2/例13.9/例13.9-数据汇总示例：贸易额汇总.py:24: FutureWarning: The provided callable <function mean at 0x1010beac0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  df_202201=df.groupby(['地区', '进出口'])['2022-01'].agg([len,np.sum, np.mean])
2022-01的贸易额和均值, df_202201: 
         len        sum          mean
地区 进出口                              
亚洲 出口     3   12184.88   4061.626667
   进口     3    4610.97   1536.990000
欧洲 出口     4   44539.62  11134.905000
   进口     4  303290.08  75822.520000
美洲 出口     3  199813.17  66604.390000
   进口     3  227876.56  75958.853333

按列求和，df_sum:
2022-01    792315.280000
2022-02    445155.720000
2022-03    530732.910000
平均值        589401.303333
dtype: float64

按列求均值，df_mean：
 2022-01    39615.764000
2022-02    22257.786000
2022-03    26536.645500
平均值        29470.065167
dtype: float64

'''